fernan3ox/Invernadero-Psoc/Invernadero.cydsn/codegentemp/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.2
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "ADC.h"
#include "Opamp.h"
#include "LM35_In_aliases.h"
#include "LM35_In.h"
#include "HS05.h"
#include "isrRX.h"
#include "Clock_1.h"
#include "Cooler2_aliases.h"
#include "Cooler2.h"
#include "PWM.h"
#include "Cooler1_aliases.h"
#include "Cooler1.h"
#include "LED_aliases.h"
#include "LED.h"
#include "MotorA_aliases.h"
#include "MotorA.h"
#include "MotorB_aliases.h"
#include "MotorB.h"
#include "PWMO_aliases.h"
#include "PWMO.h"
#include "ADC_AMux.h"
#include "ADC_Ext_CP_Clk.h"
#include "ADC_IRQ.h"
#include "ADC_theACLK.h"
#include "HS05_IntClock.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

